InformationRegisters/ОсновныеДолжностиПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеДолжностиПредприятия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоступКДаннымПоЗП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсновныеДолжностиПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОсновныеДолжностиПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ОсновныеДолжностиПредприятия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дивизионер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Финансист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учетчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассирПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассирУчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Операционист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаФК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коммерсант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Казначей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ОсновныеДолжностиПредприятия/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверитьВыбор(Отказ);
КонецПроцедуры

Процедура ПроверитьВыбор(Отказ)
	
	Если НЕ БюджетныйНаСервере.РольАдминаДоступнаСервер() И НЕ РольДоступна("Кадровик") Тогда
		Если БюджетныйНаСервере.ПолучитьПредприятия().Найти(Запись.Предприятие) = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Вы выбрали недоступное вам предприятие!";
			Сообщение.Поле = "Предприятие";
			//Сообщение.УстановитьДанные(ЭтаФорма);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если БПСервер.ПолучитьМассивПользователей().Найти(БПСервер.ПолучитьРуководителя(Запись.Сотрудник)) = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Данный пользователь не находится в вашем непосредственном подчинении.";
			Сообщение.Поле = "Запись.Сотрудник";
			//Сообщение.УстановитьДанные(ЭтаФорма);
			Сообщение.Сообщить(); 
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	
	//проверяем на уникальность в случае только доступа
	Если НЕ Запись.Должность = Перечисления.ОсновныеДолжностиПредприятия.БезДолжности Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОсновныеДолжностиПредприятия.Предприятие,
		               |	ОсновныеДолжностиПредприятия.Должность,
		               |	ОсновныеДолжностиПредприятия.Подразделение
		               |ИЗ
		               |	РегистрСведений.ОсновныеДолжностиПредприятия КАК ОсновныеДолжностиПредприятия
		               |ГДЕ
		               |	ОсновныеДолжностиПредприятия.Предприятие = &Предприятие
		               |	И ОсновныеДолжностиПредприятия.Должность = &Должность
		               |	И ОсновныеДолжностиПредприятия.Подразделение = &Подразделение";
		
		Запрос.УстановитьПараметр("Предприятие", Запись.Предприятие);
		Запрос.УстановитьПараметр("Должность", Запись.Должность);
		Запрос.УстановитьПараметр("Подразделение", Запись.Подразделение);
		
		Результат = Запрос.Выполнить();
		ЭтоНоваяЗапись = ?(ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Должность), Ложь, Истина); 
		Выборка = ?(ЭтоНоваяЗапись, Результат.Выбрать().Количество(), Результат.Выбрать().Количество() - ЭтоНоваяЗапись) ;
		
		
		Если Выборка Тогда
			
			Если БПСервер.ПолучитьМассивПользователей().Найти(БПСервер.ПолучитьРуководителя(Запись.Сотрудник)) = Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Невозможно назначение двух пользователей на уникальные должности.";
				Сообщение.Поле = "Запись.Должность";
				//Сообщение.УстановитьДанные(ЭтаФорма);
				Сообщение.Сообщить(); 
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПредприятиеПриИзменении(Элемент)
	ТекПараметры = БюджетныйНаСервере.ВернутьРеквизиты(Запись.Предприятие, "УчетПоПодразделениям, ЭтоГруппа");
	Если НЕ ТекПараметры = Неопределено И ТекПараметры.Свойство("ЭтоГруппа") И НЕ ТекПараметры.ЭтоГруппа Тогда
		Элементы.Подразделение.Доступность = ТекПараметры.УчетПоПодразделениям;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПредприятиеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОбИзменении(Запись.Сотрудник);
КонецПроцедуры
